package com.loskon.androidprojectcitizens.generator;

/**
 * Хранилище исходных данных
 */

public class SourceCitizenStore {

    // Фамилии (несклоняемые)
    private final String[] lastNameGen = {
            "Задворных",
            "Бойко",
            "Погребняк",
            "Черных",
            "Шмидт",
            "Стеблянко",
            "Моисеенко",
            "Шевченко",
            "Воробей",
            "Гладких",
            "Мейе",
            "Ли",
            "Минадзе",
            "Мартынюк",
            "Скалозуб",
            "Бок",
            "Гроза",
            "Седых",
            "Гринберг",
            "Медведенко",
            "Бегун",
            "Кравц",
            "Петренко",
            "Барских",
            "Шевченко"
    };

    public String[] getLastNameGen() {
        return lastNameGen;
    }

    // Имена
    private final String[] firstNameGen = {
            "Яна",
            "Иван",
            "Елена",
            "Мария",
            "Артем",
            "Даниил",
            "Екатерина",
            "Михаил",
            "Любовь",
            "Валерия",
            "Анастасия",
            "Александр",
            "Полина",
            "Екатерина",
            "Сергей",
            "Михаил",
            "Павел",
            "Максим",
            "Григорий",
            "Петр",
            "Никита",
            "Светлана",
            "Юлия",
            "Анна",
            "Ирина",
            "Константин"
    };

    public String[] getFirstNameGen() {
        return firstNameGen;
    }

    // Названия предприятий
    private final String[] workGen = {
            "ООО «ЛУКОЙЛ-ПЕРМЬ»",
            "АО «ЭР-ТЕЛЕКОМ ХОЛДИНГ»",
            "ООО «САТУРН-Р-АВТО»",
            "МБОУ «Гимназия № 11 им. С.П. Дягилева»",
            "ПАО «ПНППК»",
            "ООО «ЛИОН-ТРЕЙД»",
            "ООО «ИКСОЛЛА»",
            "ООО «СВИНОКОМПЛЕКС ПЕРМСКИЙ»",
            "Свято-Троицкий кафедральный Собор",
            "ООО «Неоматика»",
            "АО «ОДК-ПМ»",
            "АО «СОЛИКАМСКБУМПРОМ»",
            "Лицей имени М. В. Ломоносова",
            "ПАО «ГОРНОЗАВОДСКЦЕМЕНТ»",
            "ООО «БОЛЬШАЯ СЕМЬЯ»",
            "ООО «МАСЛОЗАВОД НЫТВЕНСКИЙ»",
            "ООО «САТУРН-Р»",
            "АО «ПЕРМСКИЙ МУКОМОЛЬНЫЙ ЗАВОД»",
            "АО «МОЛКОМБИНАТ КУНГУРСКИЙ»",
            "МАОУ «Лицей №4»",
            "АО «СИБУР-ХИМПРОМ»",
            "Храм благовещения Пресвятой Богородицы",
            "ГБОУ «Пермская государственная фармацевтическая академия»",
            "ООО «ПИВНОЙ МАСТЕР»",
            "МУУП «ТЕПЛОЭНЕРГОРЕМОНТ»"
    };

    public String[] getWorkGen() {
        return workGen;
    }

    // Названия районов
    private final String[] districtNameGen = {
            "Дзержинский",
            "Индустриальный",
            "Кировский",
            "Ленинский",
            "Мотовилихинский",
            "Орджоникидзевский",
            "Свердловский",
            "Поселок Новые Ляды"
    };

    public String[] getDistrictNameGen() {
        return districtNameGen;
    }
}
